#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2021/12/9 17:05

'''
第十课：列表：一个打了激素的数组
'''

# 0.列表都可以存放一些什么东西？
#列表可以存放：任何数据类型，比如：字符串，数字，字母，列表等

# 1.向列表增加元素有哪些方法？
#append()方法、extend()、 insert()

# 2.append()方法和extend()方法都是向列表的末尾增加元素，请问他们有什么区别？
# append() 方法是将参数作为一个元素增加到列表的末尾。
# extend() 方法则是将参数作为一个列表去扩展列表的末尾。

# 3.member.append(['竹林小溪', 'Crazy迷恋'])和member.extend(['竹林小溪', 'Crazy迷恋'])实现的效果一样吗？


# 4.有列表name = ['F', 'i', 'h', 'C']，如果小甲鱼想要在元素'i'和'h'之间插入元素's'，应该使用什么方法来插入？
# name = ['F', 'i', 'h', 'C']
# name.insert(2,'s')
# print(name)

# 动动手：

# 0.自己动手试试看，并分析在这种情况下，向列表添加数据应当采用哪种方法比较好？

# 假设给定以下列表：member = ['小甲鱼', '黑夜', '迷途', '怡静', '秋舞斜阳']

# 要求将列表修改为：member = ['小甲鱼', 88, '黑夜', 90, '迷途', 85, '怡静', 90, '秋舞斜阳', 88]

# 方法一：使用insert()和append()方法修改列表。
# member = ['小甲鱼', '黑夜', '迷途', '怡静', '秋舞斜阳']
# member.insert(1,'88')
# member.insert(3,'90')
# member.insert(5,'85')
# member.insert(7,'90')
# member.append(88)
# print(member)

# 方法二：重新创建一个同名字的列表覆盖。
# member = ['小甲鱼', '88', '黑夜', '90', '迷途', '85', '怡静', '90', '秋舞斜阳', 88]

# 1.利用for 循环打印上边 member 列表中的每个内容，如图：
# 小甲鱼
# 88
# 黑夜
# 90
# 迷途
# 85
# 怡静
# 90
# 秋舞斜阳
# 88
# member = ['小甲鱼', '88', '黑夜', '90', '迷途', '85', '怡静', '90', '秋舞斜阳', 88]
# i = 0
# for i  in range (len(member)):
#     print(member[i])
#     i += 1

# 2.上一题打印的样式不是很好，能不能修改一下代码打印成下图的样式呢？【请至少使用两种方法实现】
#方法一：
# member = ['小甲鱼', '88', '黑夜', '90', '迷途', '85', '怡静', '90', '秋舞斜阳', 88]
# i = 0
# for i  in range (len(member)):
#     if i % 2 ==0:
#         print(member[i],end=" ")
#     else:
#         print(member[i])
#     i += 1

#方法二：
# member = ['小甲鱼', '88', '黑夜', '90', '迷途', '85', '怡静', '90', '秋舞斜阳', 88]
# for each in range(len(member)):
#     if each%2 == 0:
#         print(member[each], member[each+1])

# 3.请写下这一节课你学习到的内容：格式不限，回忆并复述是加强记忆的好方式！

