#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2019/8/23 9:42

# 通过索引直接访问
a = [10,20,30,10,40,50,60,20,20]
print(a[2])
print("-----------------------------")


# index() 获取指定元素的列表中首次出现的索引
print(a.index(20))
print("-----------------------------")


# count() 获得元素在列表中出现的次数
print(a.count(20))
print("-----------------------------")


# len() 返回列表的长度
print(len(a))
print("-----------------------------")


# 成员资格的判断 in(简洁，推荐使用) 或 count
print(a.count(20) > 0)
print("-----------------------------")

a = 20 in a
print(a)
print("-----------------------------")

