#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time : 2021/10/25 15:30

'''
第一课：我和Python的第一次亲密接触
'''

#测试题：

#0. Python 是什么类型的语言？
#面向对象的语言

#1. IDLE 是什么？
#是python集成开发环境

#2. print() 的作用是什么？
#1.输出打印()中的内容 2.换行

#3. Python 中表示乘法的符号是什么？
#   *


#4. 为什么 >>>print('I love fishc.com ' * 5) 可以正常执行，但 >>>print('I love fishc.com ' + 5) 却报错？
#字符串不支持+的运算，*是运算符

#5. 如果我需要在一个字符串中嵌入一个双引号，正确的做法是？
print('我爱“小甲鱼”')


#6. 为什么我们要使用 Python3？Python2到底有什么问题？看起来很多程序员依然都在使用Python2？


#动动手：

#0. 动手试试直接输入>>>5+8 与输入>>>print(5+8) 有何不同？
#5+8 打印了类型 和结果
#print (5+8) 只打印结果

#1. 在交互模式中，使用 Python 计算一年有多少秒？
print(60*60*24*365)

#2. 设置你的操作系统的环境变量，以便可以轻松进入 Python 环境：

